from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters



START = """**
╭───────────────────⦿
│❖ 𝖧ᴇʏ ɪ'ᴍ [˹sᴏɴᴧʟɪ ꭙ ᴄʜᴧᴛ˼ [ ᴛᴘʙ ]™](t.me/purvi_chat_bot) 
├───────────────────⦿
│✦ ɪ ʜᴀᴠᴇ ᴍᴀɢɪᴄ ғᴇᴀᴛᴜʀᴇs.
│❍ 𝖠ᴅᴠᴀɴᴄᴇᴅ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛʙᴏᴛ.
├───────────────────⦿
│✦ 𝖢ʜᴀᴛʙᴏᴛ ғᴏʀ ᴛᴇʟᴇɢʀᴀᴍ ɢʀᴏᴜᴘs.
│❍ ɪ ᴄᴀɴ ʜᴇʟᴘ ᴀᴄᴛɪᴠᴇ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
│✦ 𝖴sᴀɢᴇ /chatbot [ᴏɴ/ᴏғғ].
│❍ 𝖢ʟɪᴄᴋ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ғᴏʀ ʜᴇʟᴘs.
│✦ 24x7 ᴛɪᴍᴇ ᴏɴʟɪɴᴇ sᴜᴘᴘᴏʀᴛ.
├───────────────────⦿
│❖ ϻᴀᴅᴇ ʙʏ...[˹ ᴘᴜʀᴠɪ-ᴍᴜ𝛅𝛊ᴄ™ ˼](t.me/purvi_support)♡
╰───────────────────⦿**
"""




HELP_READ = f"""**
❍ Aʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ: /
ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.  ɪғ ʏᴏᴜ'ʀᴇ ғᴀᴄɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʏᴏᴜ ᴄᴀɴ ᴀsᴋ ɪɴ sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ.**
"""

TOOLS_DATA_READ = f"""**
<u>❖ 𝖢ᴏᴍᴍᴀɴᴅs ғᴏʀ ᴛᴏᴏʟꜱ:</u>

➻ /start - Sᴛᴀʀᴛ ʙᴏᴛ !
──────────────
➻ /help - Gᴇᴛ ʜᴇʟᴘ ᴍᴇɴᴜ !
──────────────
➻ /ping - Pɪɴɢ ᴘᴏɴɢ!
──────────────
➻ /id - Gᴇᴛ ᴜsᴇʀ ɪᴅ
──────────────
➻ /broadcast [-user -pin] -  ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs !
──────────────**
"""

CHATBOT_READ = f"""**
<u>❖ 𝖢ᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʜᴀᴛʙᴏᴛ :</u>

➻ /chatbot - Eɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /lock (word) - Lᴏᴄᴋ sᴘᴀᴍ ᴡᴏʀᴅ.
──────────────
➻ /stats - Gᴇᴛ ʙᴏᴛ ꜱᴛᴀᴛꜱ.
──────────────
➻ /shayri - Gᴇᴛ ʀᴀɴᴅᴏᴍ sʜᴀʏᴀʀɪ.
──────────────**
"""

ADMIN_READ = f"sᴏᴏɴ"
